# ==============================================================================
# タスク生成用プロンプト群(目標分解チャット機能で使用予定)
# ==============================================================================
## 質問文を構築する
def build_question(sentence):  # タスク名・タスクの詳細を生成
    max_len = int(len(sentence) * 2.0)  # .format(sentence,max_len)
    text = """
    ###指示
    ユーザの達成したい目標と締切期限を参考に個人目標に対して、ユーザが達成できるように何をすべきか考えてください。
    その際、ユーザの意向や状況を加味してタスクを出力するため、必要な質問をしてください。

    ###背景情報
    あなたはユーザの目標を細分化し、達成するためのタスクとその詳細情報を作成するインストラクターです。

    ###ユーザの返答
    {}

    ###制約
    1つの返答につき、質問は１問にしてください。
    そのため、より深掘りする必要がある場合は段階的に深掘り質問を行うようにしてください。
    """.format(sentence, max_len)

    # return "「{}」という個人目標に対して、ユーザが達成できるように何をすべきかタスクをステップバイステップで教えてください。字数は{}字以下になるようにして下さい。".format(sentence, max_len)
    # return "「{}」という個人目標に対して、ユーザが達成できるように何をすべきかステップバイステップで考え、タスク毎の必要時間と締め切り時間を含めて教えてください。".format(sentence)
    # return "「{}」という個人目標に対して、ユーザが達成できるように何をすべきかステップバイステップで考え、タスク毎の総必要時間と締め切り期限、優先度、最大作業時間、最小作業時間、作業間の休憩インターバルを含めて考え、JSON形式で出力してください".format(sentence,max_len)
    return text


def build_question2(sentence, deadline):  # タスクの締切時間・総必要時間・優先順位の生成
    max_len = int(len(sentence) * 2.0)
    text = """
    ###指示
    思考過程を参考に、タスクの締切時間、タスクの総必要時間、タスクの優先順位を考えてください。

    ###締切時間(deadline)の制約
    タスクの締切時間(deadline)は目標の締切期限以下で、そのタスクが本日から何日後に全て終了させる必要があるかを日数で出力してください。
    タスクの詳細(description)を考慮して、「最終確認」や「弱点分析」のような目標達成の順序で終盤に終わらせるべきタスクは締切期限は大きくなり、
    「試験計画策定」や「実力確認」などのような目標達成の順序で最初に終わらせるべきタスクは締切期限は小さくなるように出力してください。

    ###優先順位(priority)の制約
    タスクの優先順位(priority)は、「最終確認」のような終盤で行うべきタスクは番号が小さくなるように、「試験計画策定」や「実力確認」などのような最初に行うべきタスクは番号が大きくなるように番号を割り振ってください。
    また、優先順位は1を最小値、タスク数が最大値となる連番で、重複しないようにしてください。

    ###総必要時間(required_time)の制約
    タスクの総必要時間(required_time)は目標達成に向けて成長するのに必要なタスク時間を分数(minutes)で出力してください。

    ###指示の制約
    結果は</finish>までのCSV形式のタスク情報のみ出力してください。
    出力例は形式だけを模倣し、内容は参考程度で完全に同じ出力は避けてください。

    ###思考過程と現時点の出力
    {}

    ###目標の締切期限(日数)
    {}日

    ###出力例
    TaskName,description,deadline,priority,required_time
    ...,...,5,3,300
    ...,...,8,2,200
    ...,...,11,1,250
    ...
    </finish>

    ###出力結果の意味
    <deadlineの意味>
    5：5日のうちにタスクを終わらせる。
    8：8日のうちにタスクを終わらせる。
    11：11日のうちにタスクを終わらせる。
    """.format(sentence, deadline, max_len)
    return text


def build_question2_2(sentence, deadline):  # タスクの優先順位のエラーチェック
    max_len = int(len(sentence) * 2.0)
    text = """
    ###指示
    思考過程を参考に、タスクの締切時間(deadline)が目標の締切期限を超える場合やタスクの詳細(description)を考慮して不適切な場合は、目標の締切期限を再度考え直してください。

    ###指示の制約
    ①全てのタスクの締切期限(deadline)の数値が締切期限より大きい値を取っていた場合、目標の締切期限以下になるまで繰り返してください。
    ②タスクの詳細(description)を考慮して、「最終確認」や「弱点分析」のような目標達成の順序で終盤に終わらせるべきタスクは締切期限は大きく、
    「試験計画策定」や「実力確認」などのような目標達成の順序で最初に終わらせるべきタスクは締切期限は小さくなるように出力してください。
    各タスクの締切時間が目標の締切時間以下になるまで、繰り返してください。
    締切時間(deadline)の情報だけ変更して、他の情報は変更しないでください。
    結果は実行後の</finish>までのCSV形式のタスク情報のみ出力してください。
    出力例は形式だけを模倣し、内容は参考程度で完全に同じ出力は避けてください。

    ###思考過程と現時点の出力
    {}

    ###目標の締切期限
    {}

    ###実行前
    目標の締切期限が15日の場合
    TaskName,description,deadline,priority,required_time
    ...,...,10,3,300
    ...,...,17,2,200
    ...,...,20,1,250
    ...,...,30,2,300
    ...
    </finish>

    ###実行後(出力例)
    目標の締切期限が15日の場合
    TaskName,description,deadline,priority,required_time
    ...,...,7,3,300
    ...,...,10,2,200
    ...,...,14,1,250
    ...,...,15,2,300
    ...
    </finish>
    """.format(sentence, deadline, max_len)
    return text


def build_question2_3(sentence):  # タスクの優先順位のエラーチェック
    max_len = int(len(sentence) * 2.0)
    text = """
    ###指示
    思考過程を参考に、タスクの優先順位(priority)に同じ数字で重複していた場合は、優先順位を再度考え直してください。
    優先順位が重複しているタスクが存在する場合は、その中で新たに優先順位を決定し、連続する数字にしてください。

    ###指示の制約
    優先順位に重複する数字がなくなるまでこれを繰り返してください。
    また、タスクの詳細(description)を考慮して、「最終チェック」や「弱点復習」のような終盤で行うべきタスクは番号が小さくなるように、「ノート作成」や「基礎知識学習」などのような最初に行うべきタスクは番号が大きくなるように、正しい数字が付与されているかも確認してください。
    優先順位(priority)の情報だけ変更して、他の情報は変更しないでください
    結果は実行後の</finish>までのCSV形式のタスク情報のみ出力してください。
    出力例は形式だけを模倣し、内容は参考程度で完全に同じ出力は避けてください。

    ###思考過程と現時点の出力
    {}

    ###実行前
    TaskName,description,deadline,priority,required_time
    ...,...,4,3,300
    ...,...,8,2,200
    ...,...,25,1,250
    ...,...,20,2,300
    ...
    </finish>

    ###実行後(出力例)
    TaskName,description,deadline,priority,required_time
    ...,...,4,4,300
    ...,...,8,3,200
    ...,...,25,1,250
    ...,...,20,2,300
    ...
    </finish>
    """.format(sentence, max_len)
    return text


def build_question2_4(sentence, deadline):  # 全てのタスクの総必要時間のエラーチェック
    max_len = int(len(sentence) * 2.0)
    text = """
    ###指示
    思考過程を参考に、以下の計算式にタスクの総必要時間(required_time)が満たしていない場合、再度考え直してください。
    また、このユーザの1日の空き時間は1.5時間です。

    ###指示を満たす計算式
    (1日の空き時間(分数)*締切期限(日数))*0.80 < 全てのタスクの総必要時間(required_time)の合計 <= 1日の空き時間(分数)*締切期限(日数)
    上記の計算式に満たすまでタスクの総必要時間を考え直してください。
    また、各タスクの総必要時間は5の倍数で統一してください。
    総必要時間(required_time)の情報だけ変更して、他の情報は変更しないでください
    結果は実行後の計算式を除いた</finish>までのCSV形式のタスク情報のみ出力してください。
    出力例は形式だけを模倣し、内容は参考程度で完全に同じ出力は避けてください。

    ###思考過程と現時点の出力
    {}

    ###締切期限(日数)
    {}日

    ###実行前
    締切期限15日の場合
    TaskName,description,deadline,priority,required_time
    ...,...,7,4,300
    ...,...,10,2,200
    ...,...,14,1,250
    ...,...,15,3,300
    ...
    </finish>

    ###実行前の計算式の例
    120*15(締切期限)*0.80=1440 > 1050=300+200+250+300
    「(1日の空き時間(分数)*締切期限(日数))*0.80 < 全てのタスクの総必要時間(required_time)の合計 <= 1日の空き時間(分数)*締切期限(日数)」を満たさない

    ###実行後
    締切期限15日の場合
    TaskName,description,deadline,priority,required_time
    ...,...,7,4,500
    ...,...,10,3,400
    ...,...,14,1,300
    ...,...,15,2,600
    ...
    </finish>

    ###実行後の計算式の例
    1440=120*15(締切期限)*0.80 < 500+400+300+600=1800 <= 1800=120*15(締切期限)
    「(1日の空き時間(分数)*締切期限日数)*0.80 < 全てのタスクの総必要時間(required_time)の合計 <= 1日の空き時間(分数)*締切期限日数」を満たす
    """.format(sentence, deadline, max_len)
    return text

    ##予備：②最小実行時間は5分以上
    # 前提として、タスクをいくつかのイベントとして分割することを考えます。
    # 例として総実行時間90分、最小実行時間が15分、最大実行時間を45分のタスクがあったとします。
    # そのタスクを30分の3つのイベントに分割、あるいは45分の2つのイベントに分割、というように考えます。

    # 予備:
    # 最大実行時間を、タスク分割するにあたって、成長するために必要な最大時間として分数(minutes)で出力してください。
    # 最小実行時間を、タスク分割するにあたって、成長するために必要な最小時間として分数(minutes)で出力してください。


"""保管用
思考過程を参考にして、タスク毎に最大実行時間(maxtime)、最小実行時間(mintime)をステップバイステップで考えてください。
    前提として、タスクをいくつかのイベントとして分割することを考えます。
    例として総実行時間90分、最小実行時間が15分、最大実行時間を45分のタスクがあったとします。
    そのタスクを<例1>30分の3つのイベントに分割、あるいは<例2>45分の2つのイベントに分割、というように考えます。
    また、最大実行時間と最小実行時間の関係は以下の制約に従って出力してください。
    ①最小実行時間(mintime)<最大実行時間(maxtime)<=総必要時間(required_time)
    ②最大実行時間は総必要時間を作業回数(()内の数値)で割った数(小数点切りすて)+15分以内
    ③最大実行時間/2<=最小実行時間<最大実行時間
    ④最大実行時間と最小実行時間は正の整数で出力してください。
    結果はCSV形式で出力してください。
    <例1>30分の3つのイベント、<例2>45分の2つのイベント、<例３>25分のイベント2つと40分のイベント1つ
    上記の例は、90分のタスク15分以上45分以内で分割しているため、制約を満たしています。"""


def build_question3(sentence):  # タスクの最大時間・最小時間の生成
    max_len = int(len(sentence) * 2.0)
    text = """/no think
    ###指示
    思考過程を参考にして、各タスク毎に最大実行時間(maxtime)、最小実行時間(mintime)を考えてください。
    各タスクの内容を考慮して、タスクを適切な長さのイベントに分割できるように最小実行時間と最大実行時間を設定してください。

    ###最小実行時間(mintime)と最大実行時間(maxtime)の意味
    最大実行時間と最小実行時間はタスクを複数のイベントという単位に分割するために定義します。
    タスクをいくつかのイベントに分割する理由は、長時間のタスクを分割することでユーザが高い集中力を保ち、長期的に取り組ませることで成長を促すためです。
    そのため、イベントの時間が多すぎても集中力が切れてしまったり、イベントの時間が短すぎても成長には足りなかったりすることを考慮しなければいけません。
    つまり、少ない回数で終わらせるべきタスクはmintimeとmaxtimeの数値は大きくなり、多く分割するべきタスクはmintimeとmaxtimeの数値は小さくなります。

    ###イベント分割の例
    例として、総実行時間90分、最小実行時間が15分、最大実行時間を45分のタスクAがあったとします。
    スケジューリングとして、Aは20分、35分、15分、20分のように分割すると想定できます。
    以上のようにタスクは最小実行時間以上、最大実行時間以内の範囲でイベントとして分割される。

    ###指示の制約
    「最小実行時間 != 最大実行時間」という制約を守ってください。
    最大実行時間と最小実行時間の情報だけ追加して、他の情報は変更しないでください
    結果は</finish>までのCSV形式のタスク情報のみ出力してください。
    出力例は形式だけを模倣し、内容は参考程度で完全に同じ出力は避けてください。

    ###思考過程と現時点の出力
    {}

    ###出力例
    TaskName,description,deadline,priority,required_time,maxtime,mintime
    ...,...,...,...,180,180,30
    </finish>
    """.format(sentence, max_len)
    return text


"""保存用
条件①：最大実行時間と最小実行時間が同じ値のタスクが存在する
    条件②：最大実行時間より最小実行時間の方が大きいタスクが存在する
    条件③：最大実行時間が、総必要時間(required_time)を作業回数(()の中の数字)で割った数値(必要があれば+1~15)に計算されていないタスクが存在する
    条件④：最大実行時間(maxtime)と最小実行時間(mintime)の数値が総必要時間(required_time)より、大きいタスクが存在する
    条件⑤：総必要時間・最大実行時間・最小実行時間がすべて等しいタスクが存在する
    条件⑥：最大実行時間と最小実行時間の差は最大実行時間の半分以下でないタスクが存在する
    これは、各タスクそれぞれが上記の条件に当てはまらなくなるまで考えてください。

    思考過程を参考にして、最大実行時間(maxtime)、最小実行時間(mintime)が以下の条件に当てはまっている箇所は、再度ステップバイステップで考え直してください。
    条件①：最大実行時間(maxtime) = 最小実行時間(mintime)
    条件②：最大実行時間(maxtime) < 最小実行時間(mintime)
    条件③：総必要時間(required_time) < 最大実行時間(maxtime) or 総必要時間(required_time) < 最小実行時間(mintime)
    各タスクそれぞれが上記の条件に当てはまらなくなるまで考えてください。
"""


def build_question3_2(sentence):  # タスクの最大時間・最小時間のエラーチェック
    max_len = int(len(sentence) * 2.0)
    text = """
    ###指示
    思考過程を参考にして、最大実行時間(maxtime)、最小実行時間(mintime)が以下の制約に従うように考え直してください。
    条件①：最大実行時間(maxtime) != 最小実行時間(mintime)
    条件②：最大実行時間(maxtime) > 最小実行時間(mintime)
    条件③：総必要時間(required_time) > 最大実行時間(maxtime) and 総必要時間(required_time) > 最小実行時間(mintime)
    各タスクそれぞれが上記の制約に従っている場合は終了してください。

    ###思考過程と現時点の出力
    {}

    ###指示の制約
    最大実行時間と最小実行時間の情報だけ変更して、他の情報は変更しないでください
    結果は実行後の</finish>までのCSV形式のタスク情報のみ出力してください。
    出力例は形式だけを模倣し、内容は参考程度で完全に同じ出力は避けてください。

    ###実行前
    TaskName,description,deadline,priority,required_time,maxtime,mintime
    タスクA,タスクAを行う(ツール:YouTube),1,30,300,30,30
    </finish>

    ###実行後(出力例)
    TaskName,description,deadline,priority,required_time,maxtime,mintime
    タスクA,タスクAを行う(ツール:YouTube),1,30,300,60,30
    </finish>

    <実行後の意味>
    タスクA,タスクAを行う(ツール:YouTube),1,30,300,60,30：maxtime<mintime and mintime>5 and mintime >= maxtime/2なのでmintime=30
    """.format(sentence, max_len)
    return text


def build_question4(sentence):  # タスク間のインターバルの生成
    max_len = int(len(sentence) * 2.0)
    text = """/no think
    ###指示
    思考過程を参考にして、タスク毎に休憩としてのインターバル時間(interval_minutes)を分数(minutes)で出力してください。

    ###指示の制約
    インターバル時間は同じタスク間だけでなく異なるタスク間にも適応されることを考慮して出力してください。
    また、インターバル時間にはユーザが地点を移動する移動時間も合わせて考慮して出力してください。

    ###指示の制約
    インターバル時間の情報だけ追加して、他の情報は変更しないでください
    結果は</finish>までのCSV形式のタスク情報のみ出力してください。
    出力例は形式だけを模倣し、内容は参考程度で完全に同じ出力は避けてください。

    ###思考過程と現時点の出力
    {}

    ###出力例
    TaskName,description,deadline,priority,required_time,maxtime,mintime,interval_minutes
    タスクA,タスクAを行う(ツール:YouTube),1,30,300,60,30,10
    </finish>
    """.format(sentence, max_len)
    return text


# チェーンプロンプトの配列を定義
# funcs=[build_question2,build_question2_2,build_question3,build_question3_2,build_question4]
funcs_adv = [
    build_question2,
    build_question2_2,
    build_question2_3,
    build_question2_4,
]  # funcs1の前にはbuild_question()
funcs_late = [build_question3_2, build_question4]  # funcs2の前にはbuild_question3
